app/views/movies/index.html.haml

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13') ORDER BY release_date ASC
---
    = rating
    = check_box_tag "ratings[#{rating}]", 1,Movie.ratings.include?(rating),:id=>"ratings_#{rating}"