app/controllers/movies_controller.rb

  def index

    @abc=session[:current_user_id]

    if params[:ratings]==nil
	    params[:ratings]={"G"=>1,"R"=>1,"PG-13"=>1,"PG"=>1}
	    @ratings=params[:ratings].keys
	  else
	    @ratings=params[:ratings].keys
	  end
	  @sort=params[:sort]

	  if @sort =="title"

	    @movies=Movie.order("title  ASC").where(rating: @ratings)

	  else

	    @movies=Movie.where(rating: @ratings).order("release_date  ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY title ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13') ORDER BY release_date ASC